base/Documents/бит_ФормаСбораДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_ФормаСбораДанных</Name>
			<BasedOn>
				<xr:Item>Catalog.бит_ВидыФормСбораДанных</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.бит_Дополнительный_4</xr:Item>
				<xr:Item>AccumulationRegister.бит_ОборотыПоБюджетам</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_3</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_1</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.бит_СоответствиеОборотовТрансляции</xr:Item>
				<xr:Item>AccumulationRegister.бит_ОборотыПоТипамПроводок</xr:Item>
				<xr:Item>AccumulationRegister.бит_ОборотыПроизвольныхПараметров</xr:Item>
				<xr:Item>AccountingRegister.бит_Бюджетирование</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_5</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_2</xr:Item>
				<xr:Item>InformationRegister.бит_ЗначенияПроизвольныхПараметров</xr:Item>
				<xr:Item>InformationRegister.бит_СоответствиеЗаписейТрансляции</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерПроформы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидФормыСбораДанных</Name>
					<Comment>Вид формы сбора данных</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ВидыФормСбораДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Comment>Валюта документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Comment>Курс документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьДокумента</Name>
					<Comment>Кратность документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Пользователь, ответственный за заполнение данного документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>Сумма документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Comment>Ручная корректировка (служебный реквизит)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтразитьВЗакрытомПериоде</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеШапки</Name>
					<Comment>Данные шапки</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяРеквизита</Name>
							<Comment>Имя реквизита</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеРеквизита</Name>
							<Comment>Значение реквизита</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДанныеТабличныхЧастей</Name>
					<Comment>Данные табличных частей</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяТабличнойЧасти</Name>
							<Comment>Имя табличной части</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиТаблицы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяРеквизита</Name>
							<Comment>Имя реквизита</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеРеквизита</Name>
							<Comment>Значение реквизита</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

base/InformationRegisters/бит_ДанныеТабличныхЧастейПроформ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_ДанныеТабличныхЧастейПроформ</Name>
			<Comment>(БИТ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеРеквизита</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Проформа</Name>
					<Comment>Проформа</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_ОбъектыПроформ</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяТабличнойЧасти</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСтрокиТаблицы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

base/Catalogs/бит_ВидыФормСбораДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_ВидыФормСбораДанных</Name>
			<Comment>(БИТ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Comment>Имя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОбработчикаПроведения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтекПеременных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиРеквизитов</Name>
					<Comment>Настройки реквизитов</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяТаблицы</Name>
							<Comment>Имя таблицы</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Comment>Имя</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Синоним</Name>
							<Comment>Синоним</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрТип</Name>
							<Comment>Доступные типы значений в строковом представлении</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Comment>Служит для связи с данными дерева</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПоля</Name>
							<Comment>Вид поля</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ВидыПолейПроформы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроверкаЗаполнения</Name>
							<Comment>Проверка заполнения</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КнопкаВыбора</Name>
							<Comment>Кнопка выбора</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ДаНетАвто</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КнопкаОчистки</Name>
							<Comment>Кнопка очистки</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ДаНетАвто</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КнопкаОткрытия</Name>
							<Comment>Кнопка открытия</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ДаНетАвто</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ширина</Name>
							<Comment>Ширина</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КнопкаРегулирования</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ДаНетАвто</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выгружать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыражениеПредставления</Name>
							<Comment>Выражение представления</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеНастроек</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НастройкиУстановлены</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыводитьИтог</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НастройкиДвижений</Name>
					<Comment>Движения</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Активность</Name>
							<Comment>Активность</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонДвижений</Name>
							<Comment>Шаблон движений</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ШаблоныДвижений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/Documents/бит_ФормаСбораДанных/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки	 - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.Печать

// Переопределяет настройки печати для объекта.
//
// Параметры:
//  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
		
КонецПроцедуры

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать
	
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Функция готовит данные для выгрузки проформ в Excel.
// 
// Параметры:
//  Проформы - Массив
// 
// Возвращаемое значение:
//  ДанныеДляВыгрузки - Массив.
// 
Функция ПодготовитьДанныеДляВыгрузки(ФормыСбораДанных)  Экспорт
	
	ДанныеДляВыгрузки = Новый Массив;
	СисИнфо = бит_ОбщегоНазначения.ПолучитьСведенияОПрограмме();
	
	Для каждого ТекПроформа Из ФормыСбораДанных Цикл
		
		ДанныеДокумента = ПодготовитьДанныеДокумента(ТекПроформа);		
		
		СтрНабор = Новый Структура;
		СтрНабор.Вставить("ПсевдоМетаданные", бит_РаботаСПроизвольнымиФормами.ЭмулироватьМетаданные(ТекПроформа.ВидФормыСбораДанных)); 
		СтрНабор.Вставить("Данные"          , ДанныеДокумента);
		СтрНабор.Вставить("НомерРелизаБИТ"  , СисИнфо.НомерРелиза_1С);
		
		НаименованиеПроформы = НСтр("ru='%1 №%2 от %3';en='%1 №%2 %3'");
	    НомерДляВывода = ?(ЗначениеЗаполнено(ДанныеДокумента.НомерПроформы), ДанныеДокумента.НомерПроформы, ДанныеДокумента.Номер);
		НаименованиеПроформы = СтрШаблон(НаименованиеПроформы, ТекПроформа.ВидФормыСбораДанных, НомерДляВывода, ДанныеДокумента.Дата); 
		СтрНабор.Вставить("Наименование", НаименованиеПроформы);
		ДанныеДляВыгрузки.Добавить(СтрНабор);
		
	КонецЦикла; 
	
	Возврат ДанныеДляВыгрузки;
	
КонецФункции

// Функция возвращает структуру данных документа.
// 
// Параметры:
//  Проформа - ДокументСсылка.бит_ФормаСбораДанных.
// 
// Возвращаемое значение:
//  ДанныеДокумента - Структура.
// 
Функция ПодготовитьДанныеДокумента(ФормыСбораДанных) Экспорт
	
	ПсевдоМета = бит_РаботаСПроизвольнымиФормами.ЭмулироватьМетаданные(ФормыСбораДанных.ВидФормыСбораДанных);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ФормыСбораДанных);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ФормаСбораДанных.Ссылка КАК Ссылка,
	|	ФормаСбораДанных.ПометкаУдаления КАК ПометкаУдаления,
	|	ФормаСбораДанных.Номер КАК Номер,
	|	ФормаСбораДанных.НомерПроформы КАК НомерПроформы,
	|	ФормаСбораДанных.Дата КАК Дата,
	|	ФормаСбораДанных.Проведен КАК Проведен,
	|	ФормаСбораДанных.ВидФормыСбораДанных КАК ВидФормыСбораДанных,
	|	ФормаСбораДанных.ВалютаДокумента КАК ВалютаДокумента,
	|	ФормаСбораДанных.КурсДокумента КАК КурсДокумента,
	|	ФормаСбораДанных.КратностьДокумента КАК КратностьДокумента,
	|	ФормаСбораДанных.Ответственный КАК Ответственный,
	|	ФормаСбораДанных.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.бит_ФормаСбораДанных КАК ФормаСбораДанных
	|ГДЕ
	|	ФормаСбораДанных.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеШапки.Ссылка КАК Ссылка,
	|	ДанныеШапки.НомерСтроки КАК НомерСтроки,
	|	ДанныеШапки.ИмяРеквизита КАК ИмяРеквизита,
	|	ДанныеШапки.ЗначениеРеквизита КАК ЗначениеРеквизита
	|ИЗ
	|	Документ.бит_ФормаСбораДанных.ДанныеШапки КАК ДанныеШапки
	|ГДЕ
	|	ДанныеШапки.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеТабличныхЧастей.Ссылка КАК Ссылка,
	|	ДанныеТабличныхЧастей.ИмяТабличнойЧасти КАК ИмяТабличнойЧасти,
	|	ДанныеТабличныхЧастей.НомерСтрокиТаблицы КАК НомерСтрокиТаблицы,
	|	ДанныеТабличныхЧастей.ИмяРеквизита КАК ИмяРеквизита,
	|	ДанныеТабличныхЧастей.ЗначениеРеквизита КАК ЗначениеРеквизита
	|ИЗ
	|	Документ.бит_ФормаСбораДанных.ДанныеТабличныхЧастей КАК ДанныеТабличныхЧастей
	|ГДЕ
	|	ДанныеТабличныхЧастей.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеТабличныхЧастейПроформ.Проформа,
	|	ДанныеТабличныхЧастейПроформ.ИмяТабличнойЧасти,
	|	ДанныеТабличныхЧастейПроформ.НомерСтрокиТаблицы,
	|	ДанныеТабличныхЧастейПроформ.ИмяРеквизита,
	|	ДанныеТабличныхЧастейПроформ.ЗначениеРеквизита
	|ИЗ
	|	РегистрСведений.бит_ДанныеТабличныхЧастейПроформ КАК ДанныеТабличныхЧастейПроформ
	|ГДЕ
	|	ДанныеТабличныхЧастейПроформ.Проформа = &Ссылка
	|ИТОГИ ПО
	|	ИмяТабличнойЧасти,
	|	НомерСтрокиТаблицы";
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ДанныеДокумента = Новый Структура;
	
	// Формирование данных шапки
	ВыборкаРеквизиты = МассивРезультатов[0].Выбрать();
	ВыборкаРеквизиты.Следующий();
	
	ДанныеДокумента.Вставить("Номер"              , ВыборкаРеквизиты.Номер);
	ДанныеДокумента.Вставить("НомерПроформы"      , ВыборкаРеквизиты.НомерПроформы);	
	ДанныеДокумента.Вставить("Дата"               , ВыборкаРеквизиты.Дата);
	ДанныеДокумента.Вставить("Ссылка"             , ВыборкаРеквизиты.Ссылка);
	ДанныеДокумента.Вставить("ПометкаУдаления"    , ВыборкаРеквизиты.ПометкаУдаления);
	ДанныеДокумента.Вставить("Проведен"           , ВыборкаРеквизиты.Проведен);
	ДанныеДокумента.Вставить("ВидФормыСбораДанных", ВыборкаРеквизиты.ВидФормыСбораДанных);
	ДанныеДокумента.Вставить("ВалютаДокумента"    , ВыборкаРеквизиты.ВалютаДокумента);
	ДанныеДокумента.Вставить("КурсДокумента"      , ВыборкаРеквизиты.КурсДокумента);
	ДанныеДокумента.Вставить("КратностьДокумента" , ВыборкаРеквизиты.КратностьДокумента);
	ДанныеДокумента.Вставить("СуммаДокумента"     , ВыборкаРеквизиты.СуммаДокумента);
	ДанныеДокумента.Вставить("Ответственный"      , ВыборкаРеквизиты.Ответственный);	
	
	ТаблицаДанныеШапки = МассивРезультатов[1].Выгрузить();
	
	Для каждого СтрокаТаблицы Из ТаблицаДанныеШапки Цикл
		ИмяРеквизита = СтрЗаменить(СтрокаТаблицы.ИмяРеквизита,"Шапка_","");
		ДанныеДокумента.Вставить(ИмяРеквизита, СтрокаТаблицы.ЗначениеРеквизита);
	КонецЦикла; 
	
	Для каждого МетаРеквизит Из ПсевдоМета.Реквизиты Цикл
		Если ДанныеДокумента.Свойство(МетаРеквизит.Имя) = Ложь Тогда
			ДанныеДокумента.Вставить(МетаРеквизит.Имя, МетаРеквизит.Тип.ПривестиЗначение());
		КонецЕсли; 
	КонецЦикла; 
	
	// Формирование данных табличных частей
	ВыборкаТабЧасть = МассивРезультатов[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаТабЧасть.Следующий() Цикл
		
		МодельТаблицы = Новый Массив;
		ВыборкаСтрока = ВыборкаТабЧасть.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСтрока.Следующий() Цикл
			
			МодельСтроки = ИнициализироватьМодельСтроки(ПсевдоМета, ВыборкаТабЧасть.ИмяТабличнойЧасти);
			
			ВыборкаДетали = ВыборкаСтрока.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаДетали.Следующий() Цикл
				Если МодельСтроки.Свойство(ВыборкаДетали.ИмяРеквизита) Тогда
					МодельСтроки[ВыборкаДетали.ИмяРеквизита] = ВыборкаДетали.ЗначениеРеквизита;
				Иначе
					МодельСтроки.Вставить(ВыборкаДетали.ИмяРеквизита, ВыборкаДетали.ЗначениеРеквизита);
				КонецЕсли; 
			КонецЦикла; 
			МодельТаблицы.Добавить(МодельСтроки);
		КонецЦикла; // ВыборкаСтрока
		
		ДанныеДокумента.Вставить(ВыборкаТабЧасть.ИмяТабличнойЧасти, МодельТаблицы);
	КонецЦикла; // ВыборкаТабЧасть
	
	// Проверим наличие ключей соответствующих табличным частям.
	Для каждого КиЗ Из ПсевдоМета.ТабличныеЧасти Цикл
		ИмяТабЧасти = КиЗ.Ключ;
		Если НЕ ДанныеДокумента.Свойство(ИмяТабЧасти) Тогда
			ДанныеДокумента.Вставить(ИмяТабЧасти, Новый Массив);
		КонецЕсли; 
	КонецЦикла; // ПсевдоМета.ТабличныеЧасти
	
	Возврат ДанныеДокумента;
	
КонецФункции // ПодготовитьДанныеДокумента()

// Процедура определяет имена регистров - приемников МХО 
// и помещает полученный массив в дополнительные свойства объекта. Данный массив будет 
// использоваться для проверки необходимости выполнения трансляции.
// 
// Параметры:
//  ПроформаОбъект - ДокументОбъект.бит_Проформа.
// 
Процедура ЗаполнитьПриемникиПроформы(ПроформаОбъект) Экспорт

   ПриемникиМХО = Новый Массив;	
	                                                         
   Для каждого СтрокаТаблицы Из ПроформаОбъект.ВидФормыСбораДанных.НастройкиДвижений Цикл
	   
	   Если НЕ СтрокаТаблицы.Активность Тогда
	   
	   	    Продолжить;
	   
	   КонецЕсли; 
	   
	   ИмяРегистра = СтрокаТаблицы.ШаблонДвижений.Регистр.ИмяРегистра;
	   Если ПриемникиМХО.Найти(ИмяРегистра) = Неопределено Тогда
		   
		   ПриемникиМХО.Добавить(ИмяРегистра);
		   
	   КонецЕсли; 
   
   КонецЦикла; 	

   ПроформаОбъект.ДополнительныеСвойства.Вставить("бит_ПриемникиМХО", ПриемникиМХО);
   
КонецПроцедуры // ЗаполнитьПриемникиПроформы() 

// Процедура преобразует данные модели проформы, загруженной из Excel в данные ИБ.
// 
// Параметры:
//  МодельДокумента - Структура.
//  ПсевдоМетаданные - Структура.
//  СпискиИсточники - Соответствие.
// 
Процедура РаспознатьДанные(МодельДокумента, ПсевдоМетаданные, СпискиИсточники) Экспорт
	
	// Преобразование стандартных реквизитов
	Для каждого МетаРеквизит Из ПсевдоМетаданные.СтандартныеРеквизиты Цикл
		
		ИмяРеквизита = МетаРеквизит.Имя;
		ЗагруженныйЭлемент = Неопределено;
		Если МодельДокумента.Свойство(ИмяРеквизита, ЗагруженныйЭлемент) Тогда 
			
			ТекТип = ЗагруженныйЭлемент.Мета.Тип;
			
			ЗагруженныйЭлемент.Значение = бит_ОбменДанными.ПреобразоватьЗагруженноеЗначение(ЗагруженныйЭлемент.ЗначениеСтр, ТекТип, ЗагруженныйЭлемент.ИмяСписка, СпискиИсточники);
			
		КонецЕсли;
		
	КонецЦикла; 
	
	// Преобразование данных шапки
	Для каждого МетаРеквизит Из ПсевдоМетаданные.Реквизиты Цикл
		
		ИмяРеквизита = МетаРеквизит.Имя;
		ЗагруженныйЭлемент = Неопределено;
		Если МодельДокумента.Свойство(ИмяРеквизита, ЗагруженныйЭлемент) Тогда 
			
			ТекТип = ЗагруженныйЭлемент.Мета.Тип;
			
			ЗагруженныйЭлемент.Значение = бит_ОбменДанными.ПреобразоватьЗагруженноеЗначение(ЗагруженныйЭлемент.ЗначениеСтр, 
											ТекТип, ЗагруженныйЭлемент.ИмяСписка, СпискиИсточники);
			
		КонецЕсли;
		
	КонецЦикла; 
	
	// Преобразование данных табличных частей
	Для каждого КиЗ Из ПсевдоМетаданные.ТабличныеЧасти Цикл
		
		МетаТабЧасть = КиЗ.Значение;
		
		Если МодельДокумента.Свойство(МетаТабЧасть.Имя) Тогда
			
			МассивДанных = МодельДокумента[МетаТабЧасть.Имя].МассивДанных;
			Колонки      = МодельДокумента[МетаТабЧасть.Имя].Колонки;
			
			ТабВрем = Новый ТаблицаЗначений;
			
			Для каждого КиЗ_Колонки Из Колонки Цикл
				
				НастройкаКолонки = КиЗ_Колонки.Значение; 
				
				ТабВрем.Колонки.Добавить(НастройкаКолонки.Имя);
				
			КонецЦикла; 
			
			Если МассивДанных.Количество() > 0 Тогда
				
				КоличествоСтрок = МассивДанных[0].Количество();
				
			Иначе
				
				КоличествоСтрок = 0;
				
			КонецЕсли; 
			
			Для н = 1 По КоличествоСтрок Цикл
				
				ТабВрем.Добавить();
				
			КонецЦикла; 
			
			Для каждого КиЗ_Колонки Из Колонки Цикл
				
				НастройкаКолонки = КиЗ_Колонки.Значение; 
				
				Данные = МассивДанных[НастройкаКолонки.Номер];
				Преобразованные = Новый Массив;
				
				Для каждого Элемент Из Данные Цикл
					ПреобрЗнч = бит_ОбменДанными.ПреобразоватьЗагруженноеЗначение(Элемент, 
									НастройкаКолонки.Мета.Тип, НастройкаКолонки.ИмяСписка, СпискиИсточники);
					Преобразованные.Добавить(ПреобрЗнч);
				КонецЦикла; 
				
				ТабВрем.ЗагрузитьКолонку(Преобразованные, НастройкаКолонки.Имя);
			КонецЦикла; 
			
			МодельДокумента[МетаТабЧасть.Имя].ТаблицаДанных = ТабВрем;
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры // РаспознатьДанные() 

// Функция возвращает максимальное количество строк в табличной части после которого 
// сохранение данных будет производиться в РегистреСведений.бит_ДанныеТабличныхЧастейПроформ.
// 
// Возвращаемое значение:
//  КолСтрок - Число.
// 
Функция ПредельныйРазмерТабЧасти() Экспорт

	КолСтрок = 99999;

	Возврат КолСтрок;
	
КонецФункции // ПредельныйРазмерТабЧасти()

// Функция инициализирует таблицу значений, 
// соответствующую структуре хранения данных табличных частей проформ.
// 
// Возвращаемое значение:
//  Таб - ТаблицаЗначений.
// 
Функция КонструкторТаблицыХраненияТабЧасти() Экспорт
	
	Таб = Новый ТаблицаЗначений;;
	
	Таб.Колонки.Добавить("Проформа"          , Новый ОписаниеТипов("ДокументСсылка.бит_ФормаСбораДанных"));
	Таб.Колонки.Добавить("ИмяТабличнойЧасти" , Новый ОписаниеТипов("Строка"));
	Таб.Колонки.Добавить("НомерСтрокиТаблицы", Новый ОписаниеТипов("Число"));
	Таб.Колонки.Добавить("ИмяРеквизита"      , Новый ОписаниеТипов("Строка"));
	Таб.Колонки.Добавить("ЗначениеРеквизита");
	
	Возврат Таб;
	
КонецФункции // КонструкторТаблицыХраненияТабЧасти()

// Функция возвращает результат запроса с данными табличных частей проформы.
// 
// Параметры:
//  Проформа
// 
// Возвращаемое значение:
//  ТабДанные - РезультатЗапроса.
// 
Функция ПолучитьДанныеТабличныхЧастей(ФормаСбораДанных) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ФормаСбораДанных", ФормаСбораДанных);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеТабличныхЧастей.Ссылка КАК Проформа,
	|	ДанныеТабличныхЧастей.ИмяТабличнойЧасти КАК ИмяТабличнойЧасти,
	|	ДанныеТабличныхЧастей.НомерСтрокиТаблицы КАК НомерСтрокиТаблицы,
	|	ДанныеТабличныхЧастей.ИмяРеквизита,
	|	ДанныеТабличныхЧастей.ЗначениеРеквизита
	|ИЗ
	|	Документ.бит_ФормаСбораДанных.ДанныеТабличныхЧастей КАК ДанныеТабличныхЧастей
	|ГДЕ
	|	ДанныеТабличныхЧастей.Ссылка = &ФормаСбораДанных
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеТабличныхЧастей.Проформа,
	|	ДанныеТабличныхЧастей.ИмяТабличнойЧасти,
	|	ДанныеТабличныхЧастей.НомерСтрокиТаблицы,
	|	ДанныеТабличныхЧастей.ИмяРеквизита,
	|	ДанныеТабличныхЧастей.ЗначениеРеквизита
	|ИЗ
	|	РегистрСведений.бит_ДанныеТабличныхЧастейПроформ КАК ДанныеТабличныхЧастей
	|ГДЕ
	|	ДанныеТабличныхЧастей.Проформа = &ФормаСбораДанных
	|ИТОГИ ПО
	|	ИмяТабличнойЧасти,
	|	НомерСтрокиТаблицы";
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат;
	
КонецФункции // ПолучитьДанныеТабличныхЧастей()

// Функция определяет имя таблицы проформы из которой будет выполнена загрузка 
// данных в БюджетнуюОперацию/ФормуВвода.
//
// Параметры:
//   ПсевдоМетаданные - Структура.
//
// Возвращаемое значение:
//  ИмяТаблицы - Строка.
//
Функция ИмяТаблицыДляЗагрузкиДанныхБюджета(ПсевдоМетаданные)  Экспорт

	ИмяТаблицы = "";
	
	Если ПсевдоМетаданные.ТабличныеЧасти.Свойство("БДДС") Тогда
	
		ИмяТаблицы = "БДДС";
		
    ИначеЕсли ПсевдоМетаданные.ТабличныеЧасти.Свойство("ФактическиеДанные")	Тогда
		
		ИмяТаблицы = "ФактическиеДанные";
		
	ИначеЕсли ПсевдоМетаданные.ТабличныеЧасти.Свойство("ДанныеБюджета")	 Тогда
		
		ИмяТаблицы = "ДанныеБюджета";
		
	ИначеЕсли ПсевдоМетаданные.ТабличныеЧасти.Количество() > 0 Тогда	
		
		Для каждого КиЗ Из ПсевдоМетаданные.ТабличныеЧасти Цикл
		
			ИмяТаблицы = КиЗ.Ключ;
			Прервать;
		
		КонецЦикла; 
		
	КонецЕсли; 

	Возврат ИмяТаблицы;
	
КонецФункции // ИмяТаблицыДляЗагрузкиДанныхБюджета()

// Функция получает вид проформы и эмулирует метаданные проформы.
//
// Параметры:
//   ИмяПроформы - Строка
//
// Возвращаемое значение:
//  РезСтр - Структура.
//
Функция ДанныеВидаПроформы(ИмяПроформы) Экспорт

	РезСтр = Новый Структура("ВидФормыСбораДанных, ПсевдоМетаданные, ИмяТаблицыДанных");
	РезСтр.ВидФормыСбораДанных = Справочники.бит_ВидыФормСбораДанных.НайтиПоРеквизиту("Имя",ИмяПроформы);
	Если НЕ ЗначениеЗаполнено(РезСтр.ВидФормыСбораДанных) Тогда
		ТекстСообщения = НСтр("ru = 'Для выбранного файла отсутствует шаблон в справочнике ""Виды форм сбора данных"".';
								|en = 'There is no template for the selected file in the ""Data Collection Form Types"" reference.'"); 	
		ВызватьИсключение ТекстСообщения;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(РезСтр.ВидФормыСбораДанных) Тогда
		РезСтр.ПсевдоМетаданные = бит_РаботаСПроизвольнымиФормами.ЭмулироватьМетаданные(РезСтр.ВидФормыСбораДанных);
		РезСтр.ИмяТаблицыДанных = Документы.бит_ФормаСбораДанных.ИмяТаблицыДляЗагрузкиДанныхБюджета(РезСтр.ПсевдоМетаданные);
	КонецЕсли; 

	Возврат РезСтр;
	
КонецФункции // ДанныеВидаПроформы()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция инициализирует структуру, моделирующую строку табличной части.
// 
// Параметры:
//  ПсевдоМета - Структура
//  ИмяТабЧасти - Строка
// 
// Возвращаемое значение:
//  МодельСтроки - Структура.
// 
Функция ИнициализироватьМодельСтроки(ПсевдоМета, ИмяТабЧасти)
	
	МодельСтроки = Новый Структура;
	
	Если ПсевдоМета.ТабличныеЧасти.Свойство(ИмяТабЧасти) Тогда
		МетаТабЧасть = ПсевдоМета.ТабличныеЧасти[ИмяТабЧасти];
		Для каждого МетаРеквизит Из МетаТабЧасть.Реквизиты Цикл
			МодельСтроки.Вставить(МетаРеквизит.Имя, МетаРеквизит.Тип.ПривестиЗначение());
		КонецЦикла; // МетаТабЧасть.Реквизиты
	КонецЕсли; 
	
	Возврат МодельСтроки;
	
КонецФункции // ИнициализироватьМодельСтроки()

#КонецОбласти 

#КонецЕсли
